Revit 2024 API
StructuralSectionGeneralI.SlopedFlangeAngle Property
 Sloped flange angle. (rad)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double SlopedFlangeAngle { get; set; }
Visual Basic
Public Property SlopedFlangeAngle As Double
	Get
	Set
Visual C++
public:
property double SlopedFlangeAngle {
	double get ();
	void set (double value);
}
See Also
StructuralSectionGeneralI Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace